// Wrap everything in a function to avoid polluting the global namespace.
(function() {

	TypeJig.WordSets['YanhengSingleKeys'] = [
		["D", "-D", "G", "-G", "I", "-I", 
		"N", "-N", "A", "-A", "Z", "-Z", 
		"W", "-W", "U", "-U", "E", "-E",
		"O", "-O", "B", "-B", "X"],
		["D", "-D", "G", "-G", "I", "-I", 
		"N", "-N", "A", "-A", "Z", "-Z", 
		"W", "-W", "U", "-U", "E", "-E",
		"O", "-O", "B", "-B", "X"],
		["D", "-D", "G", "-G", "I", "-I", 
		"N", "-N", "A", "-A", "Z", "-Z", 
		"W", "-W", "U", "-U", "E", "-E",
		"O", "-O", "B", "-B", "X"],
		["D", "-D", "G", "-G", "I", "-I", 
		"N", "-N", "A", "-A", "Z", "-Z", 
		"W", "-W", "U", "-U", "E", "-E",
		"O", "-O", "B", "-B", "X"],
		["D", "-D", "G", "-G", "I", "-I", 
		"N", "-N", "A", "-A", "Z", "-Z", 
		"W", "-W", "U", "-U", "E", "-E",
		"O", "-O", "B", "-B", "X"]
	];

	TypeJig.WordSets['Ch1-words'] = [
		"得知", "德格", "得以", "德烏", "的恩", "的額", "的啊", "德沃", "得不",
 		"值得", "制止", "制革", "旨意", "植物", "知恩", "之額", "之啊", "知我", "支部",
		"歌德", "擱置", "各個", "各異", "歌舞", "戈恩", "個惡", "個啊", "葛沃", "葛布",
		"醫德", "一直", "一個", "意義", "義務", "一恩", "抑惡", "伊啊", "一窩", "異步",
		"武德", "物質", "吳哥", "無疑", "無誤", "吳恩", "無惡", "五啊", "無我", "無不",
		"恩德", "恩之", "恩格", "恩億", "恩物", "恩額", "恩啊", "恩我", "恩不",
		"額的", "遏制", "額個", "惡意", "訛誤", "厄恩", "鄂啊", "額我", "顎部",
		"阿德", "啊之", "阿哥", "阿姨", "阿武", "啊恩", "啊額", "啊我", "阿布",
		"我的", "我支", "我哥", "我一", "我無", "沃恩", "我額", "我啊", "我不",
		"不得", "佈置", "布格", "不宜", "不無", "布恩", "不額", "不啊", "不我"
	];


	TypeJig.WordSets['Ch2initials'] = [
		"夫婦", "腹部", "副鋪", "父母", 
		"布鋪", "不睦", "不服",
		"瀑布", "鋪木", "匍匐",
		"幕布", "木鋪", "幕府"
	];

	TypeJig.WordSets['Ch2briefs'] = [
		"不能", "部分", "普遍", "普通", "目的", 
		"目前", "複雜", "負責", 
		"八", "八月", "。", "，"
	];

	TypeJig.WordSets['Ch2additional'] = [
		"不得", "佈置", "布格", "不宜", "不無", "鋪的", "樸直", 
		"譜儀", "穆德", "拇指", "牧歌", "木屋", "福德", "複製", 
		"弗戈", "複議", "服務", "俯臥", "得不", "支部", "葛布", 
		"異步", "無不", "顎部", "我不", "質樸", "歌譜", "臥鋪", 
		"姨母", "烏木", "阿姆", "德芙", "支付", "衣服", "八部", 
		"八畝"
	];
	
		TypeJig.WordSets['Ch3initials'] = [
		"呢了", "樂不", "樂得", "了特", "不得", "鋪的",
		"穆德", "福德", "不特", "普特", "木特", "福特",
		"呢特", "不呢", "木訥", "副呢", "了呢", "不了",
		"鋪了", "穆勒", "的了"
	];

	TypeJig.WordSets['Ch3briefs'] = [
		"得到", "德國", "特點", "特別", "樂趣", "樂觀",
		"阿拉伯", "以色列", "革命化", "無線電",
		"得罪人", "指戰員", "不能不", "普遍性",
		"服務員", "穆斯林", "特別是", "樂天派"
	];
	
	TypeJig.WordSets['Ch3sentences'] = [
 		"目前", "，", "特別是", "服務員", "不能", "得罪人", "。",
		"目前", "，", "不能", "普通", "複雜", "，", "負責", "部分", "支部", "，", "普通", "穆德", "不能", "複雜", "。",
		"目前", "，", "夫婦", "不睦", "，", "父母", "不能", "樂觀", "，", "特別是", "服務員", "，", "不能", "惡意", "得罪人", "。",
		"我的", "父母", "腹部", "特別是", "不", "樂觀", "，", "我的", "阿姨", "得知", "德國", "不能", "遏制", "，", "德國", "不能", "不", "負責", "，", "我的", "植物", "佈置", "無疑", "。",
		"醫德", "武德", "值得", "樂觀", "，", "特別是", "支部", "佈置", "植物", "，", "不得", "不服", "，", "服務員", "特點", "不能", "得罪人", "，", "特別是", "得到", "物質", "，", "不能", "樂觀", "。",
		"木", "，", "支部", "不能", "義務", "制革", "，", "一個五個", "八月", "八畝", "，", "父母", "夫婦", "阿姨", "支部", "，", "樂觀", "得到", "樂趣", "，", "樂觀", "得到", "樂觀", "，", "樂觀", "不能", "複雜", "，", "複雜", "不能", "得到", "樂趣", "。"
	];
	
	TypeJig.WordSets['Ch4initials'] = [
		"制止", "事實", "支持", "遲滯", "知識", 
		"實質", "至日", "日誌", "吃食", "市尺", "赤日", "日吃",  
		"時日", "日式", "支部", "質樸", "知母", "支付", "值得",  
		"之特", "之呢", "指了", "吃不", "吃鋪", "遲暮", "尺幅",  
		"吃得", "吃特", "吃了", "師部", "食譜", "拭目", "師傅", 
		"使得", "史特", "特質", "施樂", "日普", "日復", "日德", 
		"日特", "日呢", "日了", "不止", "樸直",  "拇指", "複製", "得知"
	];

	TypeJig.WordSets['Ch4briefs'] = [
		"知道", "只有", "持續", "持久", "時間", 
		"時候", "日期", "日本", "指戰員", "吃不上", 
		"事實上", "日用品"
	];
	TypeJig.WordSets['Ch4sentences'] = [
		"不能不", "知道", "持續", "的", "日期", "。",
		"不能不", "知", "吃不上", "的", "時候", "。",
		"特別是", "指戰員", "的", "日用品", "得到", "了", "普遍", "的", "支持", "。",
		"目前", "特別是", "服務員", "，", "不能", "惡意", "得罪人", "，", "父母", "不睦", "，", "目前", "不", "普遍", "，", "父母", "不能", "負責", "，", "部分", "知道", "複雜", "，", "不能不", "制止", "。",
		"特別是", "服務員", "不能", "只有", "日用品", "，", "部分", "日用品", "日期", "時間", "不得", "持久", "，", "特別是", "制止", "歌舞", "，", "得到", "了", "支部", "的", "普遍", "支持", "，", "不能不", "持久", "遏制", "日本", "。",
		"義務", "不能", "得到", "武德", "，", "八月", "，", "服務員", "德國", "我的", "父母", "義務", "扶持", "，", "知道", "目前", "日本", "複雜", "，", "各個", "支部", "不能", "持久", "樂觀", "。"
	];
	
	TypeJig.WordSets['Ch5initials'] = [
		"此次",	"字詞",	"次子",	"致死",	"自治",	"至此",	
		"辭職",	"誓死",	"死屍",	"日子",	"刺死",	"詩詞",		
		"私自",	"自私",	"赤字",	"次日",	"步子",	"鋪子",	
		"卜辭",	"目次",	"復次",	"不死",	"慕斯",	"此時",	
		"母子",	"詩歌",	"得自",	"慈母",	"特此",	"樂此",	
		"八字",	"字特",	"姿勢",	"福斯",	"自我",	"詞義",	
		"各自",	"依次",	"葛斯",	"夫子",	"意思",	"歌詞",	
		"滋補"
	];
	
	TypeJig.WordSets['Ch5briefs'] = [
		"自然",	"自己",	"刺激",	"此外",	"思想",	"飼料",	
		"的",	"自",	"特",	"使",	"得",	"字",
		"時",	"次",	"十",	"四",	"十分",	"十月",	
		"四川",	"四月",	"四十",	"自動化",	"思想家"
	];
	
	TypeJig.WordSets['Ch5additional'] = [
		"四日",	"四肢",	"四次",	"擱置",	"匍匐",	"醫德",	
		"恩賜",	"臥室",	"福德",	"部分",	"私服",	"無視",	
		"拇指",	"特質",	"阿福",	"穆勒",	"複製",	"只是",	
		"歌德",	"椅子",	"臥鋪",	"木訥",	"知道",	"持久",	
		"不止",	"樂觀",	"目的",	"意識",	"時間",	"阿布",	
		"普通",	"特使",	"日式",	"無恥",	"八月",	"支持",	
		"德國",	"衣服",	"不能",	"隔日",	"物資",	"目前",	
		"自負",	"至日",	"父母",	"日期",	"複雜",	"物質",	
		"樂得",	"扶持",	"自得",	"無私",	"辭賦",	"普遍",	
		"字母",	"特點",	"食譜",	"負責",	"支部",	"實質",	
		"只有",	"吃食",	"幕布",	"師傅",	"樸實",	"值得",	
		"遲暮",	"質子",	"日本",	"遲滯",	"一個",	"師資",	
		"牧歌",	"自持",	"特別",	"各式",	"樸直",	"得到",	
		"樂子",	"資格",	"支付",	"持續",	"得知",	"師部",	
		"各部",	"牧師",	"瀑布",	"樂趣",	"日誌",	"腹部",	
		"臥姿",	"市尺",	"姨母",	"幕府",	"噗嗤",	"日思",	
		"得失",	"各尺",	"時日",	"服飾",	"德斯",	"異步",	
		"質樸",	"歌譜",	"私募",	"使得",	"料",	"八",
		"道",	"國",	"扶",	"想", "八十",
	];
	
	TypeJig.WordSets['Ch5sentences'] = [
		"事實上", "只有", "次子", "扶持", "父母", "致死", "。",
		"師傅", "日日", "值日", "，", "不", "自私", "。",
		"日本", "的", "自動化", "是", "普通", "的", "。",
		"布鋪", "只有", "八十", "市尺", "的", "布", "了", "。",
		"四", "是", "四", "，", "十", "是", "十", "，", "十四", "是", "十四", "。", "十四", "不是", "四十", "，", "四十", "不是", "十四", "。"
	];
	
})(); // Execute the code in the wrapper function.
