// Wrap everything in a function to avoid polluting the global namespace.
(function() {

	TypeJig.WordSets['YanhengSingleKeys'] = [
		"D", "G", "I", "N", "A", "Z", 
		"W", "U", "E", "O", "B", "X",
		"-D", "-G", "-I", "-N", "-A", "-Z", 
		"-W", "-U", "-E", "-O", "-B", "-X"
	];

	TypeJig.WordSets['Ch1-words'] = [
		["得知", "德格", "得以", "德烏", "的恩", "的額", "的啊", "德沃", "得不",
 		"值得", "制止", "制革", "旨意", "植物", "知恩", "之額", "之啊", "知我", "支部",
		"歌德", "擱置", "各個", "各異", "歌舞", "戈恩", "個惡", "個啊", "葛沃", "葛布",
		"醫德", "一直", "一個", "意義", "義務", "一恩", "抑惡", "伊啊", "一窩", "異步",
		"武德", "物質", "吳哥", "無疑", "無誤", "吳恩", "無惡", "五啊", "無我", "無不",
		"恩德", "恩之", "恩格", "恩億", "恩物", "恩額", "恩啊", "恩我", "恩不",
		"額的", "遏制", "額個", "惡意", "訛誤", "厄恩", "鄂啊", "額我", "顎部",
		"阿德", "啊之", "阿哥", "阿姨", "阿武", "啊恩", "啊額", "啊我", "阿布",
		"我的", "我支", "我哥", "我一", "我無", "沃恩", "我額", "我啊", "我不",
		"不得", "佈置", "布格", "不宜", "不無", "布恩", "不額", "不啊", "不我"]
	];

	TypeJig.WordSets['Ch2-initials'] = [
		"夫婦", "布鋪", "不睦", "不服", "瀑布", "鋪木", "匍匐",
		"幕布", "木鋪", "幕府", "腹部", "副鋪", "父母"
	];

	TypeJig.WordSets.['Ch2-briefs'] = [
		"不能", "部分", "普遍", "普通", "目的", "目前", "複雜", "負責,"
		"八", "八月", "。", "，"
	];

	TypeJig.WordSets['Ch2-comprehensive'] = [
		"夫婦", "布鋪", "不睦", "不服", "瀑布", "鋪木", "匍匐", "幕布", 
		"木鋪", "幕府", "腹部", "副鋪", "父母", "不得", "布置", "布格", 
		"不宜", "不無", "鋪的", "樸直", "譜儀", "穆德", "拇指", "牧歌", 
		"木屋", "福德", "複製", "弗戈", "複議", "服務", "俯臥", "得不", 
		"支部", "葛布", "異步", "無不", "顎部", "我不", "質樸", "歌譜", 
		"臥鋪", "姨母", "烏木", "阿姆", "德芙", "支付", "衣服", "不能", 
		"部分", "普遍", "普通", "目的", "目前", "複雜", "負責," "八", 
		"八月", "。", "，", "八部", "八畝"
	];
	
})(); // Execute the code in the wrapper function.
