// Wrap everything in a function to avoid polluting the global namespace.
(function() {

	TypeJig.WordSets['YanhengSingleKeys'] = [
		["D", "-D", "G", "-G", "I", "-I", 
		"N", "-N", "A", "-A", "Z", "-Z", 
		"W", "-W", "U", "-U", "E", "-E",
		"O", "-O", "B", "-B", "X"],
		["D", "-D", "G", "-G", "I", "-I", 
		"N", "-N", "A", "-A", "Z", "-Z", 
		"W", "-W", "U", "-U", "E", "-E",
		"O", "-O", "B", "-B", "X"],
		["D", "-D", "G", "-G", "I", "-I", 
		"N", "-N", "A", "-A", "Z", "-Z", 
		"W", "-W", "U", "-U", "E", "-E",
		"O", "-O", "B", "-B", "X"],
		["D", "-D", "G", "-G", "I", "-I", 
		"N", "-N", "A", "-A", "Z", "-Z", 
		"W", "-W", "U", "-U", "E", "-E",
		"O", "-O", "B", "-B", "X"],
		["D", "-D", "G", "-G", "I", "-I", 
		"N", "-N", "A", "-A", "Z", "-Z", 
		"W", "-W", "U", "-U", "E", "-E",
		"O", "-O", "B", "-B", "X"]
	];

	TypeJig.WordSets['Ch1-words'] = [
		"得知", "德格", "得以", "德烏", "的恩", "的額", "的啊", "德沃", "得不",
 		"值得", "制止", "制革", "旨意", "植物", "知恩", "之額", "之啊", "知我", "支部",
		"歌德", "擱置", "各個", "各異", "歌舞", "戈恩", "個惡", "個啊", "葛沃", "葛布",
		"醫德", "一直", "一個", "意義", "義務", "一恩", "抑惡", "伊啊", "一窩", "異步",
		"武德", "物質", "吳哥", "無疑", "無誤", "吳恩", "無惡", "五啊", "無我", "無不",
		"恩德", "恩之", "恩格", "恩億", "恩物", "恩額", "恩啊", "恩我", "恩不",
		"額的", "遏制", "額個", "惡意", "訛誤", "厄恩", "鄂啊", "額我", "顎部",
		"阿德", "啊之", "阿哥", "阿姨", "阿武", "啊恩", "啊額", "啊我", "阿布",
		"我的", "我支", "我哥", "我一", "我無", "沃恩", "我額", "我啊", "我不",
		"不得", "佈置", "布格", "不宜", "不無", "布恩", "不額", "不啊", "不我"
	];


	TypeJig.WordSets['Ch2initials'] = [
		"夫婦", "腹部", "副鋪", "父母", 
		"布鋪", "不睦", "不服",
		"瀑布", "鋪木", "匍匐",
		"幕布", "木鋪", "幕府"
	];

	TypeJig.WordSets['Ch2briefs'] = [
		"不能", "部分", "普遍", "普通", "目的", 
		"目前", "複雜", "負責", 
		"八", "八月", "。", "，"
	];

	TypeJig.WordSets['Ch2additional'] = [
		"不得", "佈置", "布格", "不宜", "不無", "鋪的", "樸直", 
		"譜儀", "穆德", "拇指", "牧歌", "木屋", "福德", "複製", 
		"弗戈", "複議", "服務", "俯臥", "得不", "支部", "葛布", 
		"異步", "無不", "顎部", "我不", "質樸", "歌譜", "臥鋪", 
		"姨母", "烏木", "阿姆", "德芙", "支付", "衣服", "八部", 
		"八畝"
	];
	
		TypeJig.WordSets['Ch3initials'] = [
		"呢了", "樂不", "樂得", "了特", "不得", "鋪的",
		"穆德", "福德", "不特", "普特", "木特", "福特",
		"呢特", "不呢", "木訥", "副呢", "了呢", "不了",
		"鋪了", "穆勒", "的了"
	];

	TypeJig.WordSets['Ch3briefs'] = [
		"得到", "德國", "特點", "特別", "樂趣", "樂觀",
		"阿拉伯", "以色列", "革命化", "無線電",
		"得罪人", "指戰員", "不能不", "普遍性",
		"服務員", "穆斯林", "特別是", "樂天派"
	];
	
	TypeJig.WordSets['Ch3sentences'] = [
 		"目前", "，", "特別是", "服務員", "不能", "得罪人", "。",
		"目前", "，", "不能", "普通", "複雜", "，", "負責", "部分", "支部", "，", "普通", "穆德", "不能", "複雜", "。",
		"目前", "，", "夫婦", "不睦", "，", "父母", "不能", "樂觀", "，", "特別是", "服務員", "，", "不能", "惡意", "得罪人", "。",
		"我的", "父母", "腹部", "特別是", "不", "樂觀", "，", "我的", "阿姨", "得知", "德國", "不能", "遏制", "，", "德國", "不能", "不", "負責", "，", "我的", "植物", "佈置", "無疑", "。",
		"醫德", "武德", "值得", "樂觀", "，", "特別是", "支部", "佈置", "植物", "，", "不得", "不服", "，", "服務員", "特點", "不能", "得罪人", "，", "特別是", "得到", "物質", "，", "不能", "樂觀", "。",
		"木", "，", "支部", "不能", "義務", "制革", "，", "一個五個", "八月", "八畝", "，", "父母", "夫婦", "阿姨", "支部", "，", "樂觀", "得到", "樂趣", "，", "樂觀", "得到", "樂觀", "，", "樂觀", "不能", "複雜", "，", "複雜", "不能", "得到", "樂趣", "。"
	];

})(); // Execute the code in the wrapper function.
